{
  "Navigation": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "AboutSection": {
    "title": "About Me",
    "description": "Junior frontend developer aspirant with a solid specialization in the JavaScript framework React. My study focus has been on mastering this technology in depth, allowing me to understand web architecture and create intuitive and engaging user experiences. I am excited to apply my expertise in a professional environment and contribute to the development of innovative projects."
  },
  "SkillsSection": {
    "title": "Skills",
    "section1": "Languages",
    "section2": "Hosting/SaaS",
    "section3": "Frameworks, Plataforms y Libraries",
    "certificatesButton": "See my certificates"
  },
  "ProjectsSection": {
    "title": "My Projects",
    "description": "This section collects my GitHub repositories using its API. You can find more information about my featured projects by clicking on 'View details'.",
    "cardDetailsTitle": "See details",
    "cardLanguagesTitle": "Languages used:",
    "featuresTitle": "Features",
    "technologiesTitle":"Technologies Used",
    "FutureTechDesc": "Future Tech is an online store that fully leverages the capabilities of Next.js, including dynamic routing, server-side rendering, and SEO optimization.",
    "FutureTechFeat": "Integration with the Shopify API.| Data fetching with GraphQL.| Robust authentication system using access token generation and validation.| Server actions for user creation and authentication, as well as managing the shopping cart and checkout process.| Cache revalidation by tag or route to keep data up-to-date.| Advanced cookie management.| State management in server components with Zustand.| Load optimization with parallel routing.| Implementation of dynamic routes and route protection.",
    "ShopiDesc": "Shopi is an online store built with React.js as a practice project. It allows filtering products by title and category, viewing product details, adding products to the shopping cart, checking out, and reviewing purchase history.",
    "ShopiFeat": "API consumption.|Data persistence with Local Storage.| Detailed product information through a modal.| Product search and filtering by title and category.| Navigation with React Router DOM.| Route protection.| Shopping cart.| Orders page and individual order.| Authentication system.| User views: Log In, Create Account, Sign In, Sign Up.| Dynamic navbar depending on whether the user is authenticated or not (email, My Orders, My Account).",
    "ReduxPokedexDesc": "Web application that allows exploring detailed information about different Pokémon, integrating advanced state management and API calls.",
    "ReduxPokedexFeat": "Integration with the PokeAPI using Axios for data retrieval.| Store configuration with Redux Toolkit, efficiently defining reducers.| Using slices to define the initial state and actions, optimizing the structure of the application's state trees.| Implementation of asynchronous actions with Redux Toolkit's createAsyncThunk to fetch and organize Pokémon data by region.| Efficient state management of the application, facilitating data handling and component communication.",
    "ToDoMachineDesc": "TO DO Machine is a web application developed in React.js that simplifies task management. It allows adding, editing, completing, and deleting tasks easily, as well as searching and counting tasks.",
    "ToDoMachineFeat": "Loading and error states.| Using the useEffect hook to handle side effects.| Using the useReducer hook to handle state and actions in local storage.| Custom Hooks: useLocalStorage and useTodos to manage local storage and task logic.| React Router DOM: Navigation between views using HashRouter.| Render props and render functions for component reuse and flexibility.| ChangeAlert: Higher-order component to alert users about changes in the application."
  },
  "ContactSection": {
    "title": "Contact",
    "emailButton": "Send me an email",
    "cvButton": "See my resume",
    "coursesButton": "See my courses"
  }
}